#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьСписокТестов();

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	ЗаполнитьСписокТестов();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТестироватьСоединениеЧерезПроксиПриИзменении(Элемент)
	ТестироватьСоединениеЧерезПроксиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТестироватьПолучениеСпискаРелизовВСайта1СПриИзменении(Элемент)
	ТестироватьПолучениеСпискаРелизовВСайта1СПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТестироватьАутентификациюAWS4_HMAC_SHA256ПриИзменении(Элемент)
	ТестироватьАутентификациюAWS4_HMAC_SHA256ПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТестироватьПовторыПриИзменении(Элемент)
	ТестироватьПовторыПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьТесты(Команда)
	
	ВыполнитьТестыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Тесты Цикл
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Тесты Цикл
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокТестов()
	
	Тесты.Очистить();
	Для Каждого Тест Из РеквизитФормыВЗначение("Объект").ПолучитьСписокТестов() Цикл
		НоваяСтрока = Тесты.Добавить();
		НоваяСтрока.Использование = Истина;
		НоваяСтрока.Тест = Тест;
	КонецЦикла;
	КоличествоТестов = Тесты.Количество();

КонецПроцедуры

&НаСервере
Процедура ТестироватьСоединениеЧерезПроксиПриИзмененииНаСервере()
	
	ЗаполнитьСписокТестов();
	
КонецПроцедуры

&НаСервере
Процедура ТестироватьПолучениеСпискаРелизовВСайта1СПриИзмененииНаСервере()

	ЗаполнитьСписокТестов();

КонецПроцедуры

&НаСервере
Процедура ТестироватьАутентификациюAWS4_HMAC_SHA256ПриИзмененииНаСервере()

	ЗаполнитьСписокТестов();

КонецПроцедуры

&НаСервере
Процедура ТестироватьПовторыПриИзмененииНаСервере()

	ЗаполнитьСписокТестов();

КонецПроцедуры

&НаСервере
Процедура ВыполнитьТестыНаСервере()
	
	Если ПроверитьЗаполнение() Тогда
		РезультатаВыполнения = РеквизитФормыВЗначение("Объект").ВыполнитьТестыНаСервере(РеквизитФормыВЗначение("Тесты"));
		ЗначениеВРеквизитФормы(РезультатаВыполнения, "Тесты");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
